HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/helyxMultiRegionHeater/helyxMap/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

rm -rf constant/polyMesh/sets

runApplication blockMesh
runApplication surfaceFeatureExtract

runApplication helyxHexMesh -overwrite
runApplication splitMeshRegions -cellZones -overwrite

# remove fluid fields from solid regions (important for post-processing)
for i in heater leftSolid rightSolid
do
   rm -f 0*/$i/{nut,alphat,epsilon,k,U,p_rgh}
done


for i in bottomAir topAir heater leftSolid rightSolid
do
   runApplication -s $i  changeDictionary -region $i
done


#-- Run on single processor
runApplication helyxMap

## Decompose
#runApplication decomposePar -allRegions
#
## Run
#runParallel helyxMap
#
## Reconstruct
#runApplication reconstructPar -allRegions -withZero


#------------------------------------------------------------------------------
